# коды к параметру API [weathercode] в описании применяется
weather_codes = {
    0: "Ясное небо",
    1: "Преимущественно ясно",
    2: "Частичная облачность",
    3: "Переменная облачность",
    45: "Туман",
    48: "Туман с изморосью",
    51: "Легкая морось",
    53: "Умеренная морось",
    55: "Сильная морось",
    56: "Легкая морось с замерзанием",
    57: "Сильная морось с замерзанием",
    61: "Легкий дождь",
    63: "Умеренный дождь",
    65: "Сильный дождь",
    66: "Легкий дождь с замерзанием",
    67: "Сильный дождь с замерзанием",
    71: "Легкий снегопад",
    73: "Умеренный снегопад",
    75: "Сильный снегопад",
    77: "Снежные зерна",
    80: "Легкий ливневый дождь",
    81: "Умеренный ливневый дождь",
    82: "Сильный ливневый дождь",
    85: "Легкий ливневый снег",
    86: "Сильный ливневый снег",
    95: "Гроза",
    96: "Гроза с легким градом",
    99: "Гроза с сильным градом"
}

# если что-то пошло не так...
error_bot = f"""❌ Ошибка, попробуй воспользоваться ботом позже...."""

